{"Recipe": {"Ingredients": [{"quantity": "12", "name": "whole wheat lasagna noodles"}, {"quantity": "1", "measurement": "pound", "name": "lean ground beef"}, {"quantity": "2", "preparation": "chopped", "name": "cloves garlic,"}, {"quantity": "0.5", "measurement": "teaspoon", "name": "garlic powder"}, {"quantity": "1", "measurement": "teaspoon", "name": "dried egano,"}, {"quantity": "", "measurement": "to taste", "name": "salt and ground black pepper"}, {"quantity": "16", "measurement": "ounce", "name": "package cottage cheese"}, {"quantity": "2", "name": "eggs"}, {"quantity": "0.5", "measurement": "cup", "name": "shredded Parmesan cheese"}, {"quantity": "12.5", "measurement": "ounce", "name": "jars tomato-basil pasta sauce"}, {"quantity": "2", "measurement": "cup", "name": "shredded mozzarella cheese"}], "Tools": ["pot", "bowl", "dish", "plate", "pan", "aluminum foil", "skillet", "oven"], "Methods": {"Primary_cooking_method": ["boil", "bake"], "alternative_cooking_method": ["stirring", "sprinkle", "mix", "grease", "heat"]}, "Steps": ["Preheat oven to 350 degrees F (175 degrees C).", "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, add the lasagna noodles a few at a time, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 10 minutes. Remove the noodles to a plate.", "Place the ground beef into a skillet over medium heat, add the garlic, garlic powder, oregano, salt, and black pepper to the skillet. Cook the meat, chopping it into small chunks as it cooks, until no longer pink, about 10 minutes. Drain excess grease.", "In a bowl, mix the cottage cheese, eggs, and Parmesan cheese until thoroughly combined.", "Place 4 noodles side by side into the bottom of a 9x13-inch baking pan; top with a layer of the tomato-basil sauce, a layer of ground beef mixture, and a layer of the cottage cheese mixture. Repeat layers twice more, ending with a layer of sauce; sprinkle top with the mozzarella cheese. Cover the dish with aluminum foil.", "Bake in the preheated oven until the casserole is bubbling and the cheese has melted, about 30 minutes. Remove foil and bake until cheese has begun to brown, about 10 more minutes. Allow to stand at least 10 minutes before serving."]}}